____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 256, 256, 3)   0                                            
____________________________________________________________________________________________________
separable_conv2d_keras_1 (Separa (None, 128, 128, 32)  155         input_1[0][0]                    
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 128, 128, 32)  128         separable_conv2d_keras_1[0][0]   
____________________________________________________________________________________________________
separable_conv2d_keras_2 (Separa (None, 64, 64, 32)    1344        batch_normalization_1[0][0]      
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 64, 64, 32)    128         separable_conv2d_keras_2[0][0]   
____________________________________________________________________________________________________
separable_conv2d_keras_3 (Separa (None, 32, 32, 32)    1344        batch_normalization_2[0][0]      
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 32, 32, 32)    128         separable_conv2d_keras_3[0][0]   
____________________________________________________________________________________________________
separable_conv2d_keras_4 (Separa (None, 16, 16, 32)    1344        batch_normalization_3[0][0]      
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 16, 16, 32)    128         separable_conv2d_keras_4[0][0]   
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 16, 16, 8)     264         batch_normalization_4[0][0]      
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 16, 16, 8)     32          conv2d_1[0][0]                   
____________________________________________________________________________________________________
bilinear_up_sampling2d_1 (Biline (None, 32, 32, 8)     0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
separable_conv2d_keras_5 (Separa (None, 32, 32, 32)    360         bilinear_up_sampling2d_1[0][0]   
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 32, 32, 32)    128         separable_conv2d_keras_5[0][0]   
____________________________________________________________________________________________________
separable_conv2d_keras_6 (Separa (None, 32, 32, 32)    1344        batch_normalization_6[0][0]      
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 32, 32, 32)    128         separable_conv2d_keras_6[0][0]   
____________________________________________________________________________________________________
bilinear_up_sampling2d_2 (Biline (None, 64, 64, 32)    0           batch_normalization_7[0][0]      
____________________________________________________________________________________________________
separable_conv2d_keras_7 (Separa (None, 64, 64, 32)    1344        bilinear_up_sampling2d_2[0][0]   
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, 64, 64, 32)    128         separable_conv2d_keras_7[0][0]   
____________________________________________________________________________________________________
separable_conv2d_keras_8 (Separa (None, 64, 64, 32)    1344        batch_normalization_8[0][0]      
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 64, 64, 32)    128         separable_conv2d_keras_8[0][0]   
____________________________________________________________________________________________________
bilinear_up_sampling2d_3 (Biline (None, 128, 128, 32)  0           batch_normalization_9[0][0]      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 128, 128, 64)  0           bilinear_up_sampling2d_3[0][0]   
                                                                   batch_normalization_1[0][0]      
____________________________________________________________________________________________________
separable_conv2d_keras_9 (Separa (None, 128, 128, 32)  2656        concatenate_1[0][0]              
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 128, 128, 32)  128         separable_conv2d_keras_9[0][0]   
____________________________________________________________________________________________________
separable_conv2d_keras_10 (Separ (None, 128, 128, 32)  1344        batch_normalization_10[0][0]     
____________________________________________________________________________________________________
batch_normalization_11 (BatchNor (None, 128, 128, 32)  128         separable_conv2d_keras_10[0][0]  
____________________________________________________________________________________________________
bilinear_up_sampling2d_4 (Biline (None, 256, 256, 32)  0           batch_normalization_11[0][0]     
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 256, 256, 35)  0           bilinear_up_sampling2d_4[0][0]   
                                                                   input_1[0][0]                    
____________________________________________________________________________________________________
separable_conv2d_keras_11 (Separ (None, 256, 256, 32)  1467        concatenate_2[0][0]              
____________________________________________________________________________________________________
batch_normalization_12 (BatchNor (None, 256, 256, 32)  128         separable_conv2d_keras_11[0][0]  
____________________________________________________________________________________________________
separable_conv2d_keras_12 (Separ (None, 256, 256, 32)  1344        batch_normalization_12[0][0]     
____________________________________________________________________________________________________
batch_normalization_13 (BatchNor (None, 256, 256, 32)  128         separable_conv2d_keras_12[0][0]  
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 256, 256, 3)   99          batch_normalization_13[0][0]     
====================================================================================================
Total params: 17,321
Trainable params: 16,537
Non-trainable params: 784
